Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/unemployed_people/employment_supports.html.txt.tmx
Source language: en
Languages: ga

source: Employment services for jobseekers
ga: Seirbhísí fostaíochta do chuardaitheoirí poist

source: • Services available to jobseekers
ga: • JobPath • Seirbhísí atá ar fáil ag cuardaitheoirí poist

source: The Department of Social Protection (DSP) provides employment support and advice to jobseekers nationwide
ga: Soláthraíonn an Roinn Coimirce Sóisialaí (RCS) tacaíocht agus comhairle fostaíochta do chuardaitheoirí poist ar fud na tíre

source: Jobseekers include people who are getting a jobseeker’s payment, people who are signing for credits and people who are unemployed but not eligible for a payment
ga: I measc cuardaitheoirí poist, tá daoine a bhfuil íocaíocht chuardaitheora poist á fáil acu, daoine a shíníonn do na creidmheasanna agus daoine atá dífhostaithe ach nach bhfuil incháilithe d’íocaíocht a fháil

source: However priority is generally given to people getting a jobseeker’s payment
ga: Tugtar tús áite, áfach, go ginearálta do dhaoine a fhaigheann íocaíocht chuardaitheora poist

source: All DSP employment services offices are now Intreo Centres
ga: Athbhrandáladh go leor oifigí áitiúla leasa shóisialaigh agus oifigí seirbhísí fostaíochta an RCS mar ionaid Intreo

source: Intreo provides a one-stop shop for employment services and income supports with a range of personalised supports to jobseekers
ga: Soláthraíonn Intreo ionad ilfhreastail le haghaidh seirbhísí fostaíochta agus tacaíochtaí ioncaim le réimse tacaíochtaí pearsantaithe do chuardaitheoirí poist

source: In your local Intreo Centre you can get jobseeking advice, information on job vacancies and income support (your weekly payment) all in one place
ga: I d’ionad áitiúil Intreo, féadfaidh tú comhairle faoi chuardach poist, faisnéis faoi fholúntais phoist agus tacaíocht ioncaim (d’íocaíocht sheachtainiúil) a fháil san aon áit amháin

source: Details of locations are published on welfare.ie
ga: Foilsítear sonraí faoi láithreacha nua ar welfare.ie

source: Find out what happens when you sign on for a jobseeker’s payment at an Intreo Centre
ga: Is féidir leat a dheimhniú cad a tharlaíonn nuair a shíníonn tú d’íocaíocht chuardaitheora poist ag ionad Intreo

source: If you do not have a local Intreo Centre you can make a claim for a jobseeker's payment at your local Social Welfare Branch Office and you can register for employment services at your Local Employment Service (LES) office
ga: Cuid chomhtháite de sheirbhís Intreo iad seirbhísí fostaíochta, ach i roinnt láithreacha, níl seirbhís Intreo go hiomlán oibríochtúil

source: │Labour market activation policies are designed to give jobseekers a better chance of finding employment
ga: │Deartar beartais ghníomhachtaithe an mhargaidh shaothair chun deis níos fearr a thabhairt do chuardaitheoirí poist chun fostaíocht a aimsiú

source: The Department of Social Protection describes activation as its engagement with jobseekers to support them back into employment
ga: Is é an cur síos a dhéanann an Roinn Coimirce Sóisialaí ar ghníomhachtú ná a n-idirchaidreamh le cuardaitheoirí poist chun tacú leo go dtí go mbíonn siad fostaithe arís

source: Jobseekers are expected to fully engage with this process and use the supports offered during the activation process which might include education or training schemes, employment support schemes to help them back into the workplace, internships and other supports.│
ga: Bítear ag súil leis go mbíonn cuardaitheoirí poist rannpháirteach go hiomlán sa phróiseas seo agus go n-úsáideann siad na tacaíochtaí a chuirtear ar fáil i rith an phróisis ghníomhachtaithe, a bhféadfadh scéimeanna oideachais nó oiliúna, scéimeanna tacaíochta fostaíochta chun cabhrú leo filleadh ar an ionad oibre, intéirneachtaí agus tacaíochtaí eile, a bheith i gceist leis.│

source: │People aged under 62 who do not engage with the activation process may have their payment reduced and can subsequently be disqualified from their payment for up to 9 weeks
ga: │Is féidir íocaíocht daoine atá faoi bhun aois 62 bliain nach mbíonn rannpháirteach sa phróiseas gníomhachtaithe a laghdú ach, dá thoradh, féadtar iad a dhícháiliú óna n-íocaíocht ar feadh a mhéid le 9 seachtaine

source: Jobseekers aged over 62 do not have to engage with the activation process
ga: Ní gá do chuardaitheoirí poist atá os cionn aois 62 bliain bheith rannpháirteach sa phróiseas gníomhachtaithe

source: │Read more about the conditions that apply to your jobseekers’ payment
ga: │Léigh níos mó faoi na coinníollacha a bhaineann le d’íocaíocht chuardaitheora poist

source: JobPath is a new employment activation programme that is intended to help jobseekers find and retain full-time employment
ga: Clár nua gníomhachtaithe fostaíochta is ea JobPath atá in ainm is cabhrú le cuardaitheoirí poist chun fostaíocht lánaimseartha a aimsiú agus a choimeád

source: The Department of Social Protection selects clients for JobPath on a random basis
ga: Roghnaíonn an Roinn Coimirce Sóisialaí cliaint le haghaidh JobPath ar bhonn randamach

source: You cannot apply to go on JobPath
ga: Ní féidir leat iarratas a dhéanamh chun bheith rannpháirteach in JobPath

source: Supports from JobPath are aimed at people who are long-term unemployed and people who are newly unemployed but who may need intensive support to find work
ga: Tá tacaíochtaí ó JobPath dírithe ar dhaoine atá dífhostaithe go fadtéarmach agus ar dhaoine atá dífhostaithe le déanaí ach a bhféadadh go dteastaíonn tacaíocht dhian uathu chun obair a aimsiú

source: If you are selected for JobPath you will be referred to a JobPath company
ga: Má roghnaítear thú do JobPath, déanfar thú a atreorú chuig cuideachta JobPath

source: There are two companies - Seetec and Turas Nua
ga: Tá dhá chuideachta ann - Seetec agus Turas Nua

source: You will be assigned to a personal adviser who will assess your skills, work experience and work goals
ga: Déanfar thú a shannadh do chomhairleoir pearsanta a dhéanfaidh measúnú ar do scileanna, taithí oibre agus do spriocanna oibre

source: The adviser will draw up a Personal Progression Plan with you which will include a series of activities and actions designed to help you get a job
ga: Cuirfidh an comhairleoir Plean um Dhul Chun Cinn Pearsanta a chur le chéile leat, lena n-áireofar sraith gníomhaíochtaí agus gníomhartha atá in ainm is cabhrú leat post a fháil

source: These might include work experience, training and other relevant supports
ga: D’fhéadfadh taithí oibre, oiliúint agus tacaíochtaí ábhartha eile a bheith i gceist leo seo

source: You will be given career advice and helped with CV and interview preparation
ga: Cuirfear comhairle gairme ort agus cabhrófar leat le do CV agus le hullmhú a dhéanamh d’agallamh

source: You can also get support and advice about starting your own business
ga: Chomh maith leis sin, féadfaidh tú tacaíocht agus comhairle a fháil faoi do ghnólacht féin a thosú

source: You keep your jobseeker's payment while on JobPath
ga: Féadfaidh tú d’íocaíocht chuardaitheora poist a choimeád fad a bhíonn tú ar JobPath

source: Generally the programme lasts for a year (52 weeks)
ga: Maireann an clár ar feadh bliain amháin (52 seachtain) go ginearálta

source: If you find a job the Jobpath company will continue to work with you while you are in employment for up to a year
ga: Má aimsíonn tú post, leanfaidh cuideachta JobPath ag oibriú leat fad a bhíonn tú fostaithe ar feadh a fhad le bliain

source: It will give particular support during the first few weeks of employment
ga: Tabharfaidh sé tacaíocht ar leith i rith na chéad chúpla seachtain d’fhostaíocht

source: If you are registered with Jobpath you are not eligible for DSP employment support schemes (such as Tús or Community Employment)
ga: Má tá tú cláraithe le JobPath, níl tú incháilithe do scéimeanna tacaíochta fostaíochta an RCS (ar nós Tús nó Fostaíocht Pobail)

source: Depending on local arrangements, while you are on JobPath you may sign on for your jobseeker's payment less often than at present, or in some situations you may not have to sign on at all
ga: Ag brath ar shocruithe áitiúla, fad a bhíonn tú rannpháirteach in JobPath, b’fhéidir nach mbeidh ort síniú a mhinice a shíníonn tú faoi láthair chun d’íocaíocht cuardaitheora poist a fháil, nó i gcásanna áirithe, b’fhéidir nach mbeidh ort síniú a dhéanamh in aon chor

source: Services available to jobseekers
ga: Seirbhísí atá ar fáil ag cuardaitheoirí poist

source: Employment services are available to all EEA nationals
ga: Tá seirbhísí fostaíochta ar fáil ag gach náisiúnach den LEE

source: If you are from outside the EEA you should contact your local Intreo Centre or Social Welfare Branch Office to check your eligibility
ga: Más ó áit lasmuigh den LEE thú, ba cheart duit teagmháil a dhéanamh le d’ionad áitiúil Intreo nó le d’oifig leasa shóisialaigh le do theidlíocht a sheiceáil

source: You need a Personal Public Services (PPS) number to register for employment services
ga: Teastaíonn Uimhir Phearsanta Seirbhíse Poiblí (PSP) uait chun clárú do sheirbhísí fostaíochta

source: In some cases you will be directed to these supports through the Department’s activation process
ga: I roinnt cásanna, atreorófar thú chuig na tacaíochtaí seo trí phróiseas gníomhachtaithe na Roinne

source: If you are not claiming a payment or are not engaged in activation (for example, if you are over 62) you can also access some of these supports directly, although in some cases priority may be given to people getting a jobseeker’s payment
ga: Mura bhfuil íocaíocht á héileamh agat nó mura bhfuil tú rannpháirteach i ngníomhachtú (mar shampla, má tá tú os cionn 62 bliain d’aois), féadfaidh tú rochtain a fháil ar roinnt de na tacaíochtaí seo go díreach, ach d’fhéadfaí tús áite a thabhairt, i roinnt cásanna, do dhaoine a bhfuil íocaíocht chuardaitheora poist á fáil acu

source: The services and supports include:
ga: I measc na seirbhísí agus na dtacaíochtaí seo, tá an méid a leanas:

source: • A group engagement session with other jobseekers to give you an overview of the supports available
ga: • Seisiún rannpháirtíochta grúpa le cuardaitheoirí poist eile chun forbhreathnú a thabhairt duit ar na tacaíochtaí atá ar fáil

source: You are assigned to a group engagement session when you first sign on for a jobseeker’s payment
ga: Sanntar thú do sheisiún rannpháirtíochta grúpa nuair a shíníonn tú d’íocaíocht chuardaitheora poist i dtosach báire

source: • Depending on your jobseeker profile one-to-one sessions with a DSP case officer to discuss employment opportunities, training courses, financial supports and other options which may lead to employment
ga: • Ag brath ar do phróifíl chuardaitheora poist, d’fhéadfadh fostaíocht bheith mar thoradh ar sheisiúin duine ar dhuine le hoifigeach cáis an RCS chun plé a dhéanamh ar dheiseanna fostaíochta, cúrsaí oiliúna, tacaíochtaí airgeadais agus roghanna eile

source: If you are getting a jobseeker’s payment you will be given on-going appointments to monitor your progression towards employment, training or education
ga: Má tá íocaíocht chuardaitheora poist á fáil agat, tabharfar coinní leanúnacha duit chun monatóireacht a dhéanamh ar do dhul chun cinn i dtreo fostaíochta, oiliúna nó oideachais

source: • A Jobseeker Information booklet that gives practical advice on CVs, job application letters, interviews, recruitment channels and summarises the employment and training supports that may help you in your job search
ga: • D’fhéadfadh leabhrán faisnéise do chuardaitheoirí a thugann comhairle phraiticiúil duit ar CVanna, litreacha iarratais ar phoist, agallaimh, bealaí earcaíochta agus a dhéanann achoimriú ar na tacaíochtaí fostaíochta agus oiliúna lámh chúnta a thabhairt duit fad a bhíonn post á chuardach agat

source: • Self-service kiosks (available in Intreo Centres) where you can find and print information on jobs and training opportunities
ga: • Bothanna féinseirbhíse (atá ar fáil in ionaid Intreo agus oifigí seirbhísí fostaíochta), áit ar féidir leat teacht ar fhaisnéis ar phoist agus deiseanna oiliúna agus an fhaisnéis sin a chló

source: • The Jobs Ireland website which lists jobs available in Ireland and abroad
ga: • Láithreán gréasáin Jobs Ireland, ar a bhfuil liosta de na poist atá ar fáil in Éirinn agus thar lear

source: It also lists internships and employment programme vacancies
ga: Chomh maith leis sin, tugtar liosta de hintéirneachtaí agus de na folúntais i gcláir fostaíochta

source: You can input your CV to the Jobs Ireland database using the website
ga: Féadfaidh tú do CV a ionchur i mbunachar sonraí Jobs Ireland tríd an láithreán gréasáin a úsáid

source: Employers can access these CVs through this database and contact a jobseeker directly
ga: Féadfaidh fostóirí rochtain a fháil ar na CVanna seo tríd an mbunachar sonraí seo agus teagmháil a dhéanamh le cuardaitheoir poist go díreach

source: You can also access the Jobs Ireland website via smart phone app, by calling 1800 611 116 and via the self-service kiosks located in an Intreo Centre or local Social Welfare Branch Office
ga: Ina theannta sin, féadfaidh tú rochtain a fháil ar láithreán gréasáin Jobs Ireland trí aip ghutháin chliste, trí ghlao ar 1800 611 116 agus trí na bothanna féinseirbhíse atá lonnaithe in ionad Intreo nó in oifig áitiúil leasa shóisialaigh

source: • Job Clubs which provide supports for jobseekers including a ‘drop in’ service and formal workshops
ga: • Clubanna Post a sholáthraíonn tacaíochtaí do chuardaitheoirí poist, lena n-áirítear seirbhís ‘buail isteach’ agus ceardlanna foirmiúla

source: • The online Benefit of Work Ready Reckoner which can help you assess out the financial consequences of taking up full-time work
ga: • An Réríomhán Sochar Oibre ar líne ar féidir leis cabhrú leat measúnú a dhéanamh ar na hiarmhairtí airgeadais a bhaineann le glacadh le hobair lánaimseartha

source: The Reckoner works out the total amount you would receive on taking up full-time work (including any Family Income Supplement) and compares this to what you are getting in jobseeker payments (including Rent Supplement)
ga: Deimhníonn an Réríomhán an méid iomlán a gheofá tar éis glacadh le hobair lánaimseartha (lena n-áirítear aon Fhorlíonadh Ioncam Teaghlaigh) agus cuireann sé é seo i gcomparáid leis an méid atá á fháil agat in íocaíochtaí cuardaitheora poist (Forlíonadh Cíosa san áireamh)

source: • A Training Support Grant (TSG) is available to jobseekers and people getting certain other payments. It is not available to JobPath participants
ga: • Tá Deontas Tacaíochta Oiliúna (DTO) ar fáil ag cuardaitheoirí poist agus ag daoine a fhaigheann íocaíochtaí áirithe eile

source: The TSG provides quick access to short-term training that is not immediately available from a State provider or that will help you get a job quickly
ga: Soláthraíonn an DTO rochtain thapa ar oiliúint ghearrthéarmach nach bhfuil ar fáil láithreach ó sholáthraí Stáit nó a chabhróidh leat post a fháil go tapa

source: Your case officer can approve a grant under this scheme if it meets your identified needs (for example, as set out in your Personal Progression Plan) and is not available from another State provider
ga: Féadfaidh d’oifigeach cáis deontas a fhaomhadh faoin scéim seo má chomhlíonann sé do riachtanais shainaitheanta (mar shampla, faoi mar a leagtar amach iad i do Phlean um Dhul Chun Cinn Pearsanta) agus níl sé ar fáil ó sholáthraí eile Stáit

source: • Access to information on job opportunities throughout Europe through Eures – the European Employment Services network
ga: • Rochtain ar fhaisnéis ar dheiseanna poist ar fud na hEorpa trí Eures – an líonra Seirbhísí Eorpacha Fostaíochta

source: • You can also read about employment support schemes, training schemes and supports for people wishing to take up self-employment
ga: • Sa mhullach air sin, féadfaidh tú faisnéis a léamh faoi scéimeanna tacaíochta fostaíochta, scéimeanna oiliúna agus tacaíochtaí do dhaoine ar mian leo glacadh le féinfhostaíocht
